package model;

import java.util.HashMap;

public enum MenuEnum {
   
   //김밥류
    김밥("김밥", 1500), 야채김밥("야채김밥", 2000), 치즈김밥("치즈김밥", 2500), 참치김밥("참치김밥", 2500), 계란말이김밥("계란말이김밥", 3000),
    소고기김밥("소고기김밥", 3000), 고추김밥("고추김밥", 3000), 샐러드김밥("샐러드김밥", 3000), 모듬김밥("모듬김밥", 3000),
    
    //계절매뉴
    물냉면("물냉면", 4500), 비빔냉면("비빔냉면", 4500), 냉모밀("냉모밀", 5000), 콩국수("콩국수", 5000),
    
    //면류
    계란라면("계란라면", 2500), 김치라면("김치라면", 3000), 떡라면("떡라면", 3000), 만두라면("만두라면", 3000), 치즈라면("치즈라면", 3000), 
    콩나물라면("콩나물라면", 3000), 수제비라면("수제비라면", 4000), 짬뽕라면("짬뽕라면", 4000),  우동("우동", 3500), 잔치국수("잔치국수", 4000),
    비빔국수("비빔국수", 4500), 손수제비("손수제비", 4500), 김치수제비("김치수제비", 4500), 칼국수("칼국수", 4500), 쫄면("쫄면", 4000), 
    
    //분식류
    떡볶이("떡볶이", 2500), 치즈떡볶이("치즈떡볶이", 3000), 라볶이("라볶이", 3000), 치즈라볶이("치즈라볶이", 3500), 쫄떡볶이("쫄떡볶이", 4000),
    떡국("떡국", 4500), 만두국("만두국", 4500), 떡만두국("떡만두국", 5000), 고기만두("고기만두", 3000), 김치만두("김치만두", 3000), 물만두("물만두", 3000),
    군만두("군만두", 3000), 오뎅("오뎅", 2500),
    
    //덮밥,볶음밥류
    제육덮밥("제육덮밥", 4500), 오징어덮밥("오징어덮밥", 4500), 김치덮밥("김치덮밥", 4500), 참치김치덮밥("참치김치덮밥", 5000), 소고기덮밥("소고기치덮밥", 5000),
    짜장덮밥("짜장치덮밥", 5000), 낙지덮밥("낙지치덮밥", 5500), 야채볶음밥("야채볶음밥", 4500), 김치볶음밥("김치볶음밥", 4500), 낙지볶음밥("낙지볶음밥", 5000),
    참치김치볶음밥("참치김치볶음밥", 5000), 새우볶음밥("새우볶음밥", 5000), 소고기볶음밥("소고기볶음밥", 5000), 해뮬볶음밥("해물볶음밥", 5000), 오므라이스("오므라이스", 4500),
    카레라이스("카레라이스", 4500), 참치오므라이스("참치오므라이스", 5000), 돈까스오므라이스("돈까스오므라이스", 6000),
    
    //찌개,탕류
    된장찌개("된장찌개", 4500), 순두부찌개("순두부찌개", 4500), 김치찌개("김치찌개", 4500), 참치김치찌개("참치김치찌개", 5000), 부대찌개("부대찌개", 6000),
    고등어김치조림("고등어김치조름", 5000), 올갱이해장국("올갱이해장국", 5000), 육개장("육개장", 5000), 갈비탕("갈비탕", 5000), 황태해장국("황태해장국", 5500),
    뚝배기불고기("뚝배기불고기", 5000), 공기밥("공기밥", 1000),
    
    //건각죽
    호박죽("호박죽", 4500), 단팥죽("단팥죽", 4500), 소고기야채죽("소고기야채죽", 5000), 전복죽("전복죽", 6500),
    
    //비빔밥류
    비빔밥("비빔밥", 4500), 돌솥비빔밥("돌솥비빔밥", 5000), 돌솥알밥("돌솥알밥", 5500), 양푼이비빔밥("양푼이비빔밥", 10000), 잡채밥("잡채밥", 4500),
    
    //돈까스
    돈까스("돈까스", 5000), 치즈돈까스("치즈돈까스", 6000), 카레돈까스("카레돈까스", 6000), 고구마돈까스("고구마돈까스", 6000), 스페셜정식("스페셜정식", 7000), 
    스페셜정식2("스페셜정식2", 7000);

    private String name;
    private int price;
    private static HashMap<String, Integer> menuMap = new HashMap<>();

    MenuEnum(String name, int price) {
        this.name = name;
        this.price = price;
    }

    public String getName() {
        return name;
    }

    public int getPrice() {
        return price;
    }

    static {
        for (MenuEnum menu : MenuEnum.values()){
            menuMap.put(menu.name, menu.price);
        }
    }
}